//index.js
//获取应用实例
var app = getApp()
Page({
  data: {
    indicatorDots: true,
    interval: 4000,
    duration: 1000,
    imgs: [
      {
        id: '1',
        url: '/img/1.jpg',
      },
      {
        id: '2',
        url: '/img/2.jpg',
      },
      {
        id: '3',
        url: '/img/3.jpg',
      },
      {
        id: '4',
        url: '/img/4.jpg',
      },
    ],
    imger: [
      {
        name: '现代风格',
        url: '/img/fg1.jpg',
        detail:'现代风格装饰特点：由曲线和非对称线条构成，如花梗、花蕾、葡萄藤、昆虫翅膀以及自然界各种优美、波状的形体图案等，体现在墙面、栏杆、窗棂和家具等装饰上。线条有的柔美雅致，有的遒劲而富于节奏感。整个立体形式都与有条不紊的、有节奏的曲线融为一体。大量使用铁制构件，将玻璃、瓷砖等新工艺，以及铁艺制品、陶艺制品等综合运用于室内。给人以既简洁又大气的感觉，从而体现简约而不简单。',
      },
    ],
  },
})
